Escritorio/prueba_pow-main/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Ir a buscar a amel"], ["todo_list_id", 1], ["created_at", "2021-01-13 19:43:51.207633"], ["updated_at", "2021-01-13 19:43:51.207633"]]
---
  def create
    @task = @todo_list.tasks.create(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_list_id" = ? AND "tasks"."id" = ? LIMIT ?  [["todo_list_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]
---
  def destroy
    @task = @todo_list.tasks.find(params[:id])
    if @task.destroy

UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2021-01-13 19:15:49.710708"], ["updated_at", "2021-01-13 19:15:49.710990"], ["id", 3]]
---
  def complete
    @task.update_attribute(:completed_at, Time.now)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_list_id" = ? AND "tasks"."id" = ? LIMIT ?  [["todo_list_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def set_task
    @task = @todo_list.tasks.find(params[:id])